app/controllers/application_controller.rb

SELECT "users".* FROM "users" WHERE "users"."email" = ? ORDER BY "users"."id" ASC LIMIT ?  [["email", "a@a"], ["LIMIT", 1]]
---
        def role?
            u = User.where(email: session[:email]).first