app/controllers/main_controller.rb

SELECT "users".* FROM "users" WHERE "users"."email" = ? ORDER BY "users"."id" ASC LIMIT ?  [["email", "afva;fem"], ["LIMIT", 1]]
---
  def create
    u = User.where(email: params[:email]).first